---
type: CurtainGridSetIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# CurtainGridSetIterator

`Autodesk.Revit.DB.CurtainGridSetIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CurtainGridSetIterator | — | `public CurtainGridSetIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |